# SpotLightDistribution Class

---
This class encapsulates a spot light distribution.
SystemObject Autodesk.Revit.DB.LightingLightDistribution Autodesk.Revit.DB.LightingSpotLightDistribution
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class SpotLightDistribution : LightDistribution

    Public Class SpotLightDistribution
    	Inherits LightDistribution

    public ref class SpotLightDistribution : public LightDistribution

    type SpotLightDistribution =
        class
            inherit LightDistribution
        end
The SpotLightDistribution type exposes the following members.
| Name| Description
---|---|---
| SpotLightDistribution|  Creates a spot light distribution object with the following values;
  * PI/6 radians spot beam angle
  * PI/2 radians spot field angle
  * PI/6 radians tilt angle

| SpotLightDistribution(SpotLightDistribution)|  Creates a copy of the given spotlight distribution
| SpotLightDistribution(Double, Double, Double)|  Creates a spot light distribution object with the given values.
Top
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from LightDistribution)
| SpotBeamAngle|  The spot beam angle.
| SpotFieldAngle|  The spot field angle.
| TiltAngle|  The tilt angle.
Top
| Name| Description
---|---|---
| Clone|  Creates a copy of the LightDistribution derived object. (Inherited from LightDistribution)
| Dispose| (Inherited from LightDistribution)
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB.Lighting Namespace